export const orderStages = [
    {
        state: "pending",
        name: "بالانتظار",
        icon: "fa-solid fa-hourglass-start",
        description: "الطلب قيد المراجعة. يتم في هذه المرحلة التحقق من جدية الطلب والعنوان قبل القبول. يُطلب من العملاء الانتظار لتلقي تحديثات حول حالة الطلب وتأكيده.",
        
    },
    {
        state: "accepted",
        name: "تم القبول",
        icon: "fa-regular fa-calendar-check",
       
        description: "استلام الطلب بنجاح وتأكيده. في هذه المرحلة، يتم التحضير أو التسجيل لتلبية الطلب. يمكن للعملاء تلقي تحديثات إضافية حول تفاصيل الموعد أو مقدمي الخدمة المعينين.",
    },
    {
        state: "running",
        name: "جارية",
        icon: "fa-solid fa-gear",
        description: "على موقع خدمات الرعاية الصحية المنزلية تعني أن الخدمة أو الطلب قيد التقدم بنجاح. في هذه المرحلة، يتم تنفيذ الإجراءات اللازمة لإكمال الخدمة أو معالجة الطلب. يمكن للعملاء تلقي تحديثات حول تقدم العمل، مثل مرحلة الإعداد أو الخطوات التي تتخذ لتلبية الاحتياجات المحددة.",
    },
    {
        state: "done",
        name: "تمت بنجاح",
        icon: "fa-solid fa-check",
        description: "على موقع خدمات الرعاية الصحية المنزلية تعني أن الخدمة أو الطلب قيد التقدم بنجاح. في هذه المرحلة، يتم تنفيذ الإجراءات اللازمة لإكمال الخدمة أو معالجة الطلب. يمكن للعملاء تلقي تحديثات حول تقدم العمل، مثل مرحلة الإعداد أو الخطوات التي تتخذ لتلبية الاحتياجات المحددة.",
    },
];
export const refusedStages = [
    {
        state: "pending",
        name: "بالانتظار",
        icon: "fa-solid fa-hourglass-start",
        description: "الطلب قيد المراجعة. يتم في هذه المرحلة التحقق من جدية الطلب والعنوان قبل القبول. يُطلب من العملاء الانتظار لتلقي تحديثات حول حالة الطلب وتأكيده.",
    },
    {
        state: "refused",
        name: "تم الرفض",
        icon: "fa-solid fa-xmark",
        description: "رفض أو عدم قبول الطلب أو الخدمة. في هذه المرحلة، يمكن أن يكون هناك أسباب محددة للرفض، والعملاء قد يحتاجون إلى مزيد من التفاصيل حول السبب وكيفية التعامل مع الوضع.",
    },
];
export const canceledStages = [
    {
        state: "pending",
        name: "بالانتظار",
        icon: "fa-solid fa-hourglass-start",
        description: "الطلب قيد المراجعة. يتم في هذه المرحلة التحقق من جدية الطلب والعنوان قبل القبول. يُطلب من العملاء الانتظار لتلقي تحديثات حول حالة الطلب وتأكيده.",
    },
    {
        state: "canceled",
        name: "تم الالغاء",
        icon: "fa-solid fa-xmark",
        description: "رفض أو عدم قبول الطلب أو الخدمة. في هذه المرحلة، يمكن أن يكون هناك أسباب محددة للرفض، والعملاء قد يحتاجون إلى مزيد من التفاصيل حول السبب وكيفية التعامل مع الوضع.",
    },
];